[
  {
    "id": 0,
    "name": "Machine Learning",
    "teacher": "Steven Bergner",
    "description": "Machine learning is the study of computer algorithms that improve automatically through experience, which play an increasingly important role in artificial intelligence, computer science and beyond. The goal of this course is to introduce students to machine learning, starting from the foundations and gradually building up to modern techniques. Students in the course will learn about the theoretical underpinnings, modern applications and software tools for applying deep learning. This course is intended to be an introductory course for students interested in conducting research in machine learning or applying machine learning, and should prepare students for more advanced courses, such as CMPT 727 and CMPT 728. No previous knowledge of machine learning is assumed, but students are expected to have solid background in calculus, linear algebra, probability and programming using Python.",
    "image": "https://external-content.duckduckgo.com/iu/?u=https%3A%2F%2Ftse1.mm.bing.net%2Fth%3Fid%3DOIP.tvNQ41OeoyvXhwJnExRMPwAAAA%26pid%3DApi&f=1&ipt=29a55c2543978ca5895682b5215df59bc22a660020c0fa7e65310c04de9f7051&ipo=images",
    "unit": 3
  },
  {
    "id": 1,
    "name": "Big Data Lab I",
    "teacher": "Greg Baker",
    "description": "This course is one of two lab courses that are part of the Professional Master’s Program in Big Data in the School of Computing Science. This lab course aims to provide students with the hands-on experience needed for a successful career in Big Data in the information technology industry. Many of the assignments will be completed on massive publically available data sets giving them appropriate experience with cloud computing and the algorithms and software tools needed to master programming for Big Data. Over 13 weeks of lab work and 12 hours per week of lab time, the students will obtain a solid background in programming for Big Data.",
    "image": "https://www.sfu.ca/content/sfu/computing/people/faculty/gregbaker/_jcr_content/main_content/image.img.original.low.jpg/1539706189218.jpg",
    "unit": 6
  },
  {
    "id": 2,
    "name": "Distributed & Cloud Systems",
    "teacher": "Ouldooz Baghban Karimi",
    "description": "",
    "image": "https://www.sfu.ca/content/sfu/fas/computing/people/faculty/faculty-members/ouldooz-baghban-karimi.img.511698272.png",
    "unit": 3
  },
  {
    "id": 3,
    "name": "Big Data Lab II",
    "teacher": "Zhengjie Miao ",
    "description": "",
    "image": "https://www.sfu.ca/content/sfu/fas/computing/people/faculty/faculty-members/zhengjie_miao.img.64468415.png",
    "unit": 6
  }
]
